# 1,32,45,48,57,84 중 가장 큰 ㄱㅄ과 작은 값을 구하시오.
print(max(1,32,45,48,57,84),min(1,32,45,48,57,84))
# 29,95,15,85,66 의 총 합을 구하시오.
print(sum([29,95,15,85,66]))
# 29,95,15,85,66 의 평균을 구하시오
print(sum([29,95,15,85,66])/5)
# 29,95,15,85,66 합의 몫과 나머지를 구하시오
print(divmod(sum([29,95,15,85,66]))
# 3,4,8,5 중 가장 큰 값에서 작은 값의 거듭제곱을 구하시오.
print(pow(max(3,4,8,5),min(3,4,8,5)))
# 16진수 값 3D5F의 10진수 값은 무엇인가?
print("%d" % 0x3D5F)
# 10진수 값 1024의 16진수 값은 무엇인가?
print(hex(1024))
# 0x35의 2진수 값은 무엇인가?
print(bin(0x35))
# 0x35의 16진수 값은 무엇인가?
print(hex(0x35))
# 3452 + 5785의 16진수 값은 무엇인가?
print(hex(3452 + 5785))
# 0xAC + 200의 2진수 값은 무엇인가?
print(bin(0xAC + 200))